Revit 2027 API
FilePath Constructor
 Constructs a FilePath
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilePath(
	string path
)
Public Sub New (
	path As String
)
public:
FilePath(
	String^ path
)
new :
        path : string -> FilePath
Parameters
path String
 The path to the file. This path does not have to be a full path; it can be relative.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilePath Class
Autodesk.Revit.DB Namespace